# Module:1

### Data Understanding
- Numerical 
    - Continuous(e.g height,weight)
    - Discrete(eg. no.of children)
- Categorical
    - Labels (e.g gender,feedback)
- Ordinal
    - Ordered categories (e.g education levels)

#### Variable Types
- Dependent (Target)
- Independent (Features)

#### Data Types and Memory Mangement

``

In [1]:
### Reading Data From Database

Requirement already satisfied: sqlalchemy in c:\users\cvr\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\cvr\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)

In [ ]:
# import pandas as pd
# from sqlalchemy import create_engine

# username='root'
# password='root'
# host='localhost'
# database='cvr'
# con=f'mysql+mysqlconnector://{username}:{password}@{host}/{database}'

#  eng=create_engine(con)
#  # Read data from MySQL into a pandas DataFrame
#  df_sql = pd.read_sql('SELECT * FROM players', eng)
# 
#  # Display the DataFrame
#  print(df_sql)
#  print(df_sql.dtypes)

# df_csv=pd.read_csv('sample_data.csv')
# print(df_csv)
#  df_excel=pd.read_excel('student.xlsx')
#  merged_df=pd.merge(
#      pd.merge(df_sql,df_csv,on='id',how='outer')
#      ,df_excel,on='id',how='outer'
#  )

# print(merged_df.info())
# 
#  print(merged_df.memory_usage())

In [1]:
# !pip install mysql_connector_python

In [7]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv('sample_data.csv')
df

   id   name  score         city  is_active
0   1    Bob     92    Hyderabad        1.0
1   5   John     55  Los Angeles        0.0
2   6   Mary     88          NaN        NaN
3   7  James     65        Miami        1.0
4   8    NaN     72          NaN        1.0
5   9   Luke     80       Boston        0.0
6  10    NaN     90      Seattle        1.0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         7 non-null      int64
 1   name       5 non-null      object
 2   score      7 non-null      int64
 3   city       5 non-null      object
 4   is_active  6 non-null      float64
dtypes: float64(1), int64(2), object(2)
memory usage: 412.0+ bytes

In [6]:
df.memory_usage(deep=True)

Index        132
id            56
name         369
score         56
city         387
is_active     56
dtype: int64

In [ ]:
# Reducing the bits to reduce memory for each cell

In [10]:
df['id']=df['id'].astype(np.int8) # convet int64 to int8
df['is_active']=df['is_active'].astype(np.float16)
df['score']=df['score'].astype(np.int16)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         7 non-null      int8
 1   name       5 non-null      object
 2   score      7 non-null      int16
 3   city       5 non-null      object
 4   is_active  6 non-null      float16
dtypes: float16(1), int16(1), int8(1), object(2)
memory usage: 279.0+ bytes

In [12]:
df.memory_usage(deep=True)

Index        132
id             7
name         369
score         14
city         387
is_active     14
dtype: int64

In [13]:
# For Categories to Reduce memory
df['city']=df['city'].astype('category')

In [15]:
df.memory_usage(deep=True)

Index        132
id             7
name         369
score         14
city         502
is_active     14
dtype: int64

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         7 non-null      int8
 1   name       5 non-null      object
 2   score      7 non-null      int16
 3   city       5 non-null      category
 4   is_active  6 non-null      float16
dtypes: category(1), float16(1), int16(1), int8(1), object(1)
memory usage: 442.0+ bytes

# Module-2 Data Cleaning 
- Missing values
    - To Count `isnull()` , `isna()`
    - To drop `dropna()`
    - Handle `fillna()` 
- Duplicate Values
    - To Identitfy `df.duplicated()` 
    - To Drop `drop_duplicates()`

In [18]:
import pandas as pd
import numpy as np

In [24]:
df=pd.read_csv('data job posts.csv')

In [25]:
df.shape

(19001, 24)

In [23]:
## 
df.isna().sum()

jobpost                 0
date                    0
Title                  28
Company                 7
AnnouncementCode    17793
Term                11325
Eligibility         14071
Audience            18361
StartDate            9326
Duration             8203
Location               32
JobDescription       3892
JobRequirment        2522
RequiredQual          484
Salary               9379
ApplicationP           60
OpeningDate           706
Deadline               65
Notes               16790
AboutC               6531
Attach              17442
Year                    0
Month                   0
IT                      0
dtype: int64

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19001 entries, 0 to 19000
Data columns (total 24 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   jobpost           19001 non-null  object
 1   date              19001 non-null  object
 2   Title             18973 non-null  object
 3   Company           18994 non-null  object
 4   AnnouncementCode  1208 non-null   object
 5   Term              7676 non-null   object
 6   Eligibility       4930 non-null   object
 7   Audience          640 non-null    object
 8   StartDate         9675 non-null   object
 9   Duration          10798 non-null  object
 10  Location          18969 non-null  object
 11  JobDescription    15109 non-null  object
 12  JobRequirment     16479 non-null  object
 13  RequiredQual      18517 non-null  object
 14  Salary            9622 non-null   object
 15  ApplicationP      18941 non-null  object
 16  OpeningDate       18295 non-null  object
 17  Deadline          18936 non-null  object
 18  Notes             2211 non-null   object
 19  AboutC            12470 non-null  object
 20  Attach            1559 non-null   object
 21  Year              19001 non-null  int64
 22  Month             19001 non-null  int64
 23  IT                19001 non-null  bool
dtypes: bool(1), int64(2), object(21)
memory usage: 3.4+ MB

### 1 . Handling Missing Values

In [27]:
# Check Null Values
df.isnull().sum()

jobpost                 0
date                    0
Title                  28
Company                 7
AnnouncementCode    17793
Term                11325
Eligibility         14071
Audience            18361
StartDate            9326
Duration             8203
Location               32
JobDescription       3892
JobRequirment        2522
RequiredQual          484
Salary               9379
ApplicationP           60
OpeningDate           706
Deadline               65
Notes               16790
AboutC               6531
Attach              17442
Year                    0
Month                   0
IT                      0
dtype: int64

In [31]:
df['Title']
df['Company']

0                     AMERIA Investment Consulting Company
1          International Research & Exchanges Board (IREX)
2                Caucasus Environmental NGO Network (CENN)
3                                             Manoff Group
4                                   Yerevan Brandy Company
                               ...
18996                                Technolinguistics NGO
18997    "Coca-Cola Hellenic Bottling Company Armenia" ...
18998    "Coca-Cola Hellenic Bottling Company Armenia" ...
18999                                    San Lazzaro   LLC
19000                                    "Kamurj" UCO CJSC
Name: Company, Length: 19001, dtype: object

In [33]:
df['AnnouncementCode'].unique()

array([nan, '04-12', 'INT 04/003', ..., 'GPHY-FC', 'GPHY-SM', 'GPHY-SPA'],
      dtype=object)

### 4. Splitting

In [34]:
c_df

NameError: name 'c_df' is not defined